In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['sonu', 'rohan', 'rock', 'hist'],
    "marks":[90, 34, 24, 17],
    "city":['rampur', 'kolkata', 'chennai', 'mumbai']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

    name  marks     city
0   sonu     90   rampur
1  rohan     34  kolkata
2   rock     24  chennai
3   hist     17   mumbai

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

    name  marks     city
0   sonu     90   rampur
1  rohan     34  kolkata

In [8]:
df.tail(2)

   name  marks     city
2  rock     24  chennai
3  hist     17   mumbai

In [9]:
df.describe()

           marks
count   4.000000
mean   41.250000
std    33.240287
min    17.000000
25%    22.250000
50%    29.000000
75%    48.000000
max    90.000000

In [10]:
pd.read_csv('friends.csv')

   Unnamed: 0   name  marks     city
0           0   sonu     90   rampur
1           1  rohan     34  kolkata
2           2   rock     24  chennai
3           3   hist     17   mumbai

In [11]:
df

    name  marks     city
0   sonu     90   rampur
1  rohan     34  kolkata
2   rock     24  chennai
3   hist     17   mumbai

In [12]:
df['name']

0     sonu
1    rohan
2     rock
3     hist
Name: name, dtype: object

In [13]:
df['marks']

0    90
1    34
2    24
3    17
Name: marks, dtype: int64

In [14]:
df['marks'][0]

90

In [15]:
df['city'][0]= 'kolkata'

<ipython-input-15-a49369968c08>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['city'][0]= 'kolkata'

In [16]:
df

    name  marks     city
0   sonu     90  kolkata
1  rohan     34  kolkata
2   rock     24  chennai
3   hist     17   mumbai

In [17]:
df.index = ['first', 'second', 'third', 'fourth']

In [18]:
df

         name  marks     city
first    sonu     90  kolkata
second  rohan     34  kolkata
third    rock     24  chennai
fourth   hist     17   mumbai

# Series

In [19]:
ser = pd.Series(np.random.rand(34))

In [20]:
ser

0     0.394179
1     0.509200
2     0.605152
3     0.046066
4     0.634420
5     0.129404
6     0.722992
7     0.898327
8     0.114514
9     0.385475
10    0.145787
11    0.147741
12    0.111815
13    0.964261
14    0.548267
15    0.443893
16    0.091566
17    0.605667
18    0.658688
19    0.408655
20    0.666179
21    0.667844
22    0.355813
23    0.495232
24    0.585109
25    0.953371
26    0.947588
27    0.101559
28    0.648839
29    0.157033
30    0.900204
31    0.928214
32    0.059120
33    0.022705
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [22]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [23]:
newdf.head()

          0         1         2         3         4
0  0.118045  0.472049  0.981399  0.919846  0.205676
1  0.346584  0.733863  0.219542  0.581576  0.964678
2  0.521481  0.860830  0.921013  0.934605  0.079056
3  0.045064  0.503060  0.894929  0.283554  0.918563
4  0.469801  0.563382  0.273213  0.713534  0.567341

In [24]:
newdf

            0         1         2         3         4
0    0.118045  0.472049  0.981399  0.919846  0.205676
1    0.346584  0.733863  0.219542  0.581576  0.964678
2    0.521481  0.860830  0.921013  0.934605  0.079056
3    0.045064  0.503060  0.894929  0.283554  0.918563
4    0.469801  0.563382  0.273213  0.713534  0.567341
..        ...       ...       ...       ...       ...
329  0.692654  0.545235  0.807676  0.513746  0.931380
330  0.711324  0.137499  0.895745  0.943873  0.377274
331  0.377174  0.640129  0.205477  0.342263  0.805632
332  0.041228  0.746126  0.757716  0.968953  0.130972
333  0.071120  0.929151  0.533439  0.751339  0.001154

[334 rows x 5 columns]

In [25]:
type(newdf)

pandas.core.frame.DataFrame

In [26]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.501659    0.542702    0.550419    0.506820    0.498664
std      0.277717    0.292383    0.274972    0.286251    0.297205
min      0.003004    0.001292    0.002925    0.005130    0.001154
25%      0.279948    0.316372    0.321510    0.265057    0.230218
50%      0.512821    0.566570    0.569943    0.514419    0.505155
75%      0.724569    0.801302    0.794369    0.758158    0.773817
max      0.992181    0.999297    0.998303    0.992371    0.997474

In [27]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
newdf[0][0] = "Swarnava"

In [29]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newdf.head()

           0         1         2         3         4
0   Swarnava  0.472049  0.981399  0.919846  0.205676
1   0.346584  0.733863  0.219542  0.581576  0.964678
2   0.521481  0.860830  0.921013  0.934605  0.079056
3  0.0450641  0.503060  0.894929  0.283554  0.918563
4   0.469801  0.563382  0.273213  0.713534  0.567341

In [31]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [32]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [33]:
newdf.to_numpy()

array([['Swarnava', 0.4720491205306604, 0.981398998645699,
        0.9198459730209285, 0.20567568041097894],
       [0.34658377137584695, 0.7338633908311997, 0.219541834290905,
        0.5815757738083822, 0.9646784052339473],
       [0.5214813680227742, 0.8608297342092334, 0.9210127527611693,
        0.9346050759387353, 0.07905571667214906],
       ...,
       [0.37717394593327813, 0.6401287101505504, 0.205476567629428,
        0.3422627254316247, 0.805632429568522],
       [0.04122770567441669, 0.7461262628306701, 0.7577163323605001,
        0.9689534621051369, 0.13097181169855876],
       [0.07112003531856392, 0.9291511323282763, 0.5334393067240347,
        0.751338792356204, 0.0011543145377055364]], dtype=object)

In [34]:
newdf[0][0] = 0.3

<ipython-input-34-452ed7015823>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0] = 0.3

In [35]:
newdf.head()

           0         1         2         3         4
0        0.3  0.472049  0.981399  0.919846  0.205676
1   0.346584  0.733863  0.219542  0.581576  0.964678
2   0.521481  0.860830  0.921013  0.934605  0.079056
3  0.0450641  0.503060  0.894929  0.283554  0.918563
4   0.469801  0.563382  0.273213  0.713534  0.567341

In [36]:
newdf.to_numpy()

array([[0.3, 0.4720491205306604, 0.981398998645699, 0.9198459730209285,
        0.20567568041097894],
       [0.34658377137584695, 0.7338633908311997, 0.219541834290905,
        0.5815757738083822, 0.9646784052339473],
       [0.5214813680227742, 0.8608297342092334, 0.9210127527611693,
        0.9346050759387353, 0.07905571667214906],
       ...,
       [0.37717394593327813, 0.6401287101505504, 0.205476567629428,
        0.3422627254316247, 0.805632429568522],
       [0.04122770567441669, 0.7461262628306701, 0.7577163323605001,
        0.9689534621051369, 0.13097181169855876],
       [0.07112003531856392, 0.9291511323282763, 0.5334393067240347,
        0.751338792356204, 0.0011543145377055364]], dtype=object)

In [37]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.346584,0.521481,0.0450641,0.469801,0.875658,0.335545,0.561866,0.671586,0.289712,...,0.197436,0.00351356,0.190864,0.439261,0.398367,0.692654,0.711324,0.377174,0.0412277,0.07112
1,0.472049,0.733863,0.86083,0.50306,0.563382,0.657706,0.812358,0.297369,0.105865,0.0723315,...,0.728375,0.810861,0.312044,0.609025,0.558423,0.545235,0.137499,0.640129,0.746126,0.929151
2,0.981399,0.219542,0.921013,0.894929,0.273213,0.706306,0.830272,0.791607,0.670101,0.479525,...,0.373212,0.64425,0.394892,0.276573,0.530387,0.807676,0.895745,0.205477,0.757716,0.533439
3,0.919846,0.581576,0.934605,0.283554,0.713534,0.602736,0.756576,0.154274,0.825599,0.619261,...,0.365245,0.472156,0.416943,0.0587751,0.899796,0.513746,0.943873,0.342263,0.968953,0.751339
4,0.205676,0.964678,0.0790557,0.918563,0.567341,0.943114,0.271124,0.476544,0.995613,0.569372,...,0.583807,0.545787,0.819612,0.647457,0.66423,0.93138,0.377274,0.805632,0.130972,0.00115431

In [38]:
newdf

             0         1         2         3         4
0          0.3  0.472049  0.981399  0.919846  0.205676
1     0.346584  0.733863  0.219542  0.581576  0.964678
2     0.521481  0.860830  0.921013  0.934605  0.079056
3    0.0450641  0.503060  0.894929  0.283554  0.918563
4     0.469801  0.563382  0.273213  0.713534  0.567341
..         ...       ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.513746  0.931380
330   0.711324  0.137499  0.895745  0.943873  0.377274
331   0.377174  0.640129  0.205477  0.342263  0.805632
332  0.0412277  0.746126  0.757716  0.968953  0.130972
333    0.07112  0.929151  0.533439  0.751339  0.001154

[334 rows x 5 columns]

In [39]:
newdf.head()

           0         1         2         3         4
0        0.3  0.472049  0.981399  0.919846  0.205676
1   0.346584  0.733863  0.219542  0.581576  0.964678
2   0.521481  0.860830  0.921013  0.934605  0.079056
3  0.0450641  0.503060  0.894929  0.283554  0.918563
4   0.469801  0.563382  0.273213  0.713534  0.567341

In [40]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1          0
0    0.205676  0.919846  0.981399  0.472049        0.3
1    0.964678  0.581576  0.219542  0.733863   0.346584
2    0.079056  0.934605  0.921013  0.860830   0.521481
3    0.918563  0.283554  0.894929  0.503060  0.0450641
4    0.567341  0.713534  0.273213  0.563382   0.469801
..        ...       ...       ...       ...        ...
329  0.931380  0.513746  0.807676  0.545235   0.692654
330  0.377274  0.943873  0.895745  0.137499   0.711324
331  0.805632  0.342263  0.205477  0.640129   0.377174
332  0.130972  0.968953  0.757716  0.746126  0.0412277
333  0.001154  0.751339  0.533439  0.929151    0.07112

[334 rows x 5 columns]

In [41]:
newdf.head()

           0         1         2         3         4
0        0.3  0.472049  0.981399  0.919846  0.205676
1   0.346584  0.733863  0.219542  0.581576  0.964678
2   0.521481  0.860830  0.921013  0.934605  0.079056
3  0.0450641  0.503060  0.894929  0.283554  0.918563
4   0.469801  0.563382  0.273213  0.713534  0.567341

In [42]:
newdf[0]

0            0.3
1       0.346584
2       0.521481
3      0.0450641
4       0.469801
         ...
329     0.692654
330     0.711324
331     0.377174
332    0.0412277
333      0.07112
Name: 0, Length: 334, dtype: object

In [43]:
type(newdf[0])

pandas.core.series.Series

In [44]:
newdf2 = newdf

In [45]:
newdf2[0][0] = 9854

<ipython-input-45-5561f01e5d7b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 9854

In [46]:
newdf

             0         1         2         3         4
0         9854  0.472049  0.981399  0.919846  0.205676
1     0.346584  0.733863  0.219542  0.581576  0.964678
2     0.521481  0.860830  0.921013  0.934605  0.079056
3    0.0450641  0.503060  0.894929  0.283554  0.918563
4     0.469801  0.563382  0.273213  0.713534  0.567341
..         ...       ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.513746  0.931380
330   0.711324  0.137499  0.895745  0.943873  0.377274
331   0.377174  0.640129  0.205477  0.342263  0.805632
332  0.0412277  0.746126  0.757716  0.968953  0.130972
333    0.07112  0.929151  0.533439  0.751339  0.001154

[334 rows x 5 columns]

In [47]:
newdf2 = newdf.copy()

In [48]:
newdf2[0][0] = 568752

<ipython-input-48-75462e43d5f6>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 568752

In [49]:
newdf

             0         1         2         3         4
0         9854  0.472049  0.981399  0.919846  0.205676
1     0.346584  0.733863  0.219542  0.581576  0.964678
2     0.521481  0.860830  0.921013  0.934605  0.079056
3    0.0450641  0.503060  0.894929  0.283554  0.918563
4     0.469801  0.563382  0.273213  0.713534  0.567341
..         ...       ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.513746  0.931380
330   0.711324  0.137499  0.895745  0.943873  0.377274
331   0.377174  0.640129  0.205477  0.342263  0.805632
332  0.0412277  0.746126  0.757716  0.968953  0.130972
333    0.07112  0.929151  0.533439  0.751339  0.001154

[334 rows x 5 columns]

In [50]:
newdf.loc[0,0] = 654

In [51]:
newdf.head(2)

          0         1         2         3         4
0       654  0.472049  0.981399  0.919846  0.205676
1  0.346584  0.733863  0.219542  0.581576  0.964678

In [52]:
newdf.columns = list("ABCDE")

In [53]:
newdf

             A         B         C         D         E
0          654  0.472049  0.981399  0.919846  0.205676
1     0.346584  0.733863  0.219542  0.581576  0.964678
2     0.521481  0.860830  0.921013  0.934605  0.079056
3    0.0450641  0.503060  0.894929  0.283554  0.918563
4     0.469801  0.563382  0.273213  0.713534  0.567341
..         ...       ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.513746  0.931380
330   0.711324  0.137499  0.895745  0.943873  0.377274
331   0.377174  0.640129  0.205477  0.342263  0.805632
332  0.0412277  0.746126  0.757716  0.968953  0.130972
333    0.07112  0.929151  0.533439  0.751339  0.001154

[334 rows x 5 columns]

In [54]:
newdf.loc[0,'A']=652254

In [55]:
newdf.head()

           A         B         C         D         E
0     652254  0.472049  0.981399  0.919846  0.205676
1   0.346584  0.733863  0.219542  0.581576  0.964678
2   0.521481  0.860830  0.921013  0.934605  0.079056
3  0.0450641  0.503060  0.894929  0.283554  0.918563
4   0.469801  0.563382  0.273213  0.713534  0.567341

In [56]:
newdf.drop(0)

             A         B         C         D         E
1     0.346584  0.733863  0.219542  0.581576  0.964678
2     0.521481  0.860830  0.921013  0.934605  0.079056
3    0.0450641  0.503060  0.894929  0.283554  0.918563
4     0.469801  0.563382  0.273213  0.713534  0.567341
5     0.875658  0.657706  0.706306  0.602736  0.943114
..         ...       ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.513746  0.931380
330   0.711324  0.137499  0.895745  0.943873  0.377274
331   0.377174  0.640129  0.205477  0.342263  0.805632
332  0.0412277  0.746126  0.757716  0.968953  0.130972
333    0.07112  0.929151  0.533439  0.751339  0.001154

[333 rows x 5 columns]

In [57]:
newdf= newdf.drop(0, axis=0)

In [58]:
newdf

             A         B         C         D         E
1     0.346584  0.733863  0.219542  0.581576  0.964678
2     0.521481  0.860830  0.921013  0.934605  0.079056
3    0.0450641  0.503060  0.894929  0.283554  0.918563
4     0.469801  0.563382  0.273213  0.713534  0.567341
5     0.875658  0.657706  0.706306  0.602736  0.943114
..         ...       ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.513746  0.931380
330   0.711324  0.137499  0.895745  0.943873  0.377274
331   0.377174  0.640129  0.205477  0.342263  0.805632
332  0.0412277  0.746126  0.757716  0.968953  0.130972
333    0.07112  0.929151  0.533439  0.751339  0.001154

[333 rows x 5 columns]

In [59]:
newdf.loc[[1,2], ['C', 'D']]

          C         D
1  0.219542  0.581576
2  0.921013  0.934605

In [63]:
newdf.loc[:, ['C', 'D']]

            C         D
1    0.219542  0.581576
2    0.921013  0.934605
3    0.894929  0.283554
4    0.273213  0.713534
5    0.706306  0.602736
..        ...       ...
329  0.807676  0.513746
330  0.895745  0.943873
331  0.205477  0.342263
332  0.757716  0.968953
333  0.533439  0.751339

[333 rows x 2 columns]

In [64]:
newdf.loc[[1,2], :]

          A         B         C         D         E
1  0.346584  0.733863  0.219542  0.581576  0.964678
2  0.521481  0.860830  0.921013  0.934605  0.079056

In [67]:
newdf.loc[(newdf['A']<0.3)]

              A         B         C         D         E
3     0.0450641  0.503060  0.894929  0.283554  0.918563
9      0.289712  0.072331  0.479525  0.619261  0.569372
18    0.0586689  0.669075  0.566043  0.869706  0.209125
19     0.199112  0.643433  0.160912  0.811849  0.091997
23     0.152285  0.152308  0.225910  0.947008  0.314526
..          ...       ...       ...       ...       ...
324    0.197436  0.728375  0.373212  0.365245  0.583807
325  0.00351356  0.810861  0.644250  0.472156  0.545787
326    0.190864  0.312044  0.394892  0.416943  0.819612
332   0.0412277  0.746126  0.757716  0.968953  0.130972
333     0.07112  0.929151  0.533439  0.751339  0.001154

[88 rows x 5 columns]

In [68]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

              A         B         C         D         E
3     0.0450641  0.503060  0.894929  0.283554  0.918563
9      0.289712  0.072331  0.479525  0.619261  0.569372
18    0.0586689  0.669075  0.566043  0.869706  0.209125
19     0.199112  0.643433  0.160912  0.811849  0.091997
23     0.152285  0.152308  0.225910  0.947008  0.314526
..          ...       ...       ...       ...       ...
324    0.197436  0.728375  0.373212  0.365245  0.583807
325  0.00351356  0.810861  0.644250  0.472156  0.545787
326    0.190864  0.312044  0.394892  0.416943  0.819612
332   0.0412277  0.746126  0.757716  0.968953  0.130972
333     0.07112  0.929151  0.533439  0.751339  0.001154

[81 rows x 5 columns]

In [69]:
newdf.head(2)

          A         B         C         D         E
1  0.346584  0.733863  0.219542  0.581576  0.964678
2  0.521481  0.860830  0.921013  0.934605  0.079056

In [70]:
newdf.iloc[0,4]

0.9646784052339473

In [72]:
newdf.iloc[[0,5], [1,2]]

          B         C
1  0.733863  0.219542
6  0.812358  0.830272

In [73]:
newdf.head(3)

           A         B         C         D         E
1   0.346584  0.733863  0.219542  0.581576  0.964678
2   0.521481  0.860830  0.921013  0.934605  0.079056
3  0.0450641  0.503060  0.894929  0.283554  0.918563

In [75]:
newdf.drop([1])

             A         B         C         D         E
2     0.521481  0.860830  0.921013  0.934605  0.079056
3    0.0450641  0.503060  0.894929  0.283554  0.918563
4     0.469801  0.563382  0.273213  0.713534  0.567341
5     0.875658  0.657706  0.706306  0.602736  0.943114
6     0.335545  0.812358  0.830272  0.756576  0.271124
..         ...       ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.513746  0.931380
330   0.711324  0.137499  0.895745  0.943873  0.377274
331   0.377174  0.640129  0.205477  0.342263  0.805632
332  0.0412277  0.746126  0.757716  0.968953  0.130972
333    0.07112  0.929151  0.533439  0.751339  0.001154

[332 rows x 5 columns]

In [77]:
newdf.drop(['A'], axis=1)

            B         C         D         E
1    0.733863  0.219542  0.581576  0.964678
2    0.860830  0.921013  0.934605  0.079056
3    0.503060  0.894929  0.283554  0.918563
4    0.563382  0.273213  0.713534  0.567341
5    0.657706  0.706306  0.602736  0.943114
..        ...       ...       ...       ...
329  0.545235  0.807676  0.513746  0.931380
330  0.137499  0.895745  0.943873  0.377274
331  0.640129  0.205477  0.342263  0.805632
332  0.746126  0.757716  0.968953  0.130972
333  0.929151  0.533439  0.751339  0.001154

[333 rows x 4 columns]

In [78]:
newdf.drop(['A', 'C'], axis=1)

            B         D         E
1    0.733863  0.581576  0.964678
2    0.860830  0.934605  0.079056
3    0.503060  0.283554  0.918563
4    0.563382  0.713534  0.567341
5    0.657706  0.602736  0.943114
..        ...       ...       ...
329  0.545235  0.513746  0.931380
330  0.137499  0.943873  0.377274
331  0.640129  0.342263  0.805632
332  0.746126  0.968953  0.130972
333  0.929151  0.751339  0.001154

[333 rows x 3 columns]

In [79]:
newdf.drop(['C'], axis=1)

             A         B         D         E
1     0.346584  0.733863  0.581576  0.964678
2     0.521481  0.860830  0.934605  0.079056
3    0.0450641  0.503060  0.283554  0.918563
4     0.469801  0.563382  0.713534  0.567341
5     0.875658  0.657706  0.602736  0.943114
..         ...       ...       ...       ...
329   0.692654  0.545235  0.513746  0.931380
330   0.711324  0.137499  0.943873  0.377274
331   0.377174  0.640129  0.342263  0.805632
332  0.0412277  0.746126  0.968953  0.130972
333    0.07112  0.929151  0.751339  0.001154

[333 rows x 4 columns]

In [80]:
newdf.drop(['B'], axis=1)

             A         C         D         E
1     0.346584  0.219542  0.581576  0.964678
2     0.521481  0.921013  0.934605  0.079056
3    0.0450641  0.894929  0.283554  0.918563
4     0.469801  0.273213  0.713534  0.567341
5     0.875658  0.706306  0.602736  0.943114
..         ...       ...       ...       ...
329   0.692654  0.807676  0.513746  0.931380
330   0.711324  0.895745  0.943873  0.377274
331   0.377174  0.205477  0.342263  0.805632
332  0.0412277  0.757716  0.968953  0.130972
333    0.07112  0.533439  0.751339  0.001154

[333 rows x 4 columns]

In [81]:
newdf.drop(['D'], axis=1)

             A         B         C         E
1     0.346584  0.733863  0.219542  0.964678
2     0.521481  0.860830  0.921013  0.079056
3    0.0450641  0.503060  0.894929  0.918563
4     0.469801  0.563382  0.273213  0.567341
5     0.875658  0.657706  0.706306  0.943114
..         ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.931380
330   0.711324  0.137499  0.895745  0.377274
331   0.377174  0.640129  0.205477  0.805632
332  0.0412277  0.746126  0.757716  0.130972
333    0.07112  0.929151  0.533439  0.001154

[333 rows x 4 columns]

In [82]:
newdf.drop(['E'], axis=1)

             A         B         C         D
1     0.346584  0.733863  0.219542  0.581576
2     0.521481  0.860830  0.921013  0.934605
3    0.0450641  0.503060  0.894929  0.283554
4     0.469801  0.563382  0.273213  0.713534
5     0.875658  0.657706  0.706306  0.602736
..         ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.513746
330   0.711324  0.137499  0.895745  0.943873
331   0.377174  0.640129  0.205477  0.342263
332  0.0412277  0.746126  0.757716  0.968953
333    0.07112  0.929151  0.533439  0.751339

[333 rows x 4 columns]

In [83]:
newdf.drop(['A'], axis=1)

            B         C         D         E
1    0.733863  0.219542  0.581576  0.964678
2    0.860830  0.921013  0.934605  0.079056
3    0.503060  0.894929  0.283554  0.918563
4    0.563382  0.273213  0.713534  0.567341
5    0.657706  0.706306  0.602736  0.943114
..        ...       ...       ...       ...
329  0.545235  0.807676  0.513746  0.931380
330  0.137499  0.895745  0.943873  0.377274
331  0.640129  0.205477  0.342263  0.805632
332  0.746126  0.757716  0.968953  0.130972
333  0.929151  0.533439  0.751339  0.001154

[333 rows x 4 columns]

In [84]:
newdf.drop(['B'], axis=1)

             A         C         D         E
1     0.346584  0.219542  0.581576  0.964678
2     0.521481  0.921013  0.934605  0.079056
3    0.0450641  0.894929  0.283554  0.918563
4     0.469801  0.273213  0.713534  0.567341
5     0.875658  0.706306  0.602736  0.943114
..         ...       ...       ...       ...
329   0.692654  0.807676  0.513746  0.931380
330   0.711324  0.895745  0.943873  0.377274
331   0.377174  0.205477  0.342263  0.805632
332  0.0412277  0.757716  0.968953  0.130972
333    0.07112  0.533439  0.751339  0.001154

[333 rows x 4 columns]

In [85]:
newdf.drop(['C'], axis=1)

             A         B         D         E
1     0.346584  0.733863  0.581576  0.964678
2     0.521481  0.860830  0.934605  0.079056
3    0.0450641  0.503060  0.283554  0.918563
4     0.469801  0.563382  0.713534  0.567341
5     0.875658  0.657706  0.602736  0.943114
..         ...       ...       ...       ...
329   0.692654  0.545235  0.513746  0.931380
330   0.711324  0.137499  0.943873  0.377274
331   0.377174  0.640129  0.342263  0.805632
332  0.0412277  0.746126  0.968953  0.130972
333    0.07112  0.929151  0.751339  0.001154

[333 rows x 4 columns]

In [86]:
newdf.drop(['B'], axis=1)

             A         C         D         E
1     0.346584  0.219542  0.581576  0.964678
2     0.521481  0.921013  0.934605  0.079056
3    0.0450641  0.894929  0.283554  0.918563
4     0.469801  0.273213  0.713534  0.567341
5     0.875658  0.706306  0.602736  0.943114
..         ...       ...       ...       ...
329   0.692654  0.807676  0.513746  0.931380
330   0.711324  0.895745  0.943873  0.377274
331   0.377174  0.205477  0.342263  0.805632
332  0.0412277  0.757716  0.968953  0.130972
333    0.07112  0.533439  0.751339  0.001154

[333 rows x 4 columns]

In [87]:
newdf.drop(['E'], axis=1)

             A         B         C         D
1     0.346584  0.733863  0.219542  0.581576
2     0.521481  0.860830  0.921013  0.934605
3    0.0450641  0.503060  0.894929  0.283554
4     0.469801  0.563382  0.273213  0.713534
5     0.875658  0.657706  0.706306  0.602736
..         ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.513746
330   0.711324  0.137499  0.895745  0.943873
331   0.377174  0.640129  0.205477  0.342263
332  0.0412277  0.746126  0.757716  0.968953
333    0.07112  0.929151  0.533439  0.751339

[333 rows x 4 columns]

In [88]:
newdf.drop(['C'], axis=1)

             A         B         D         E
1     0.346584  0.733863  0.581576  0.964678
2     0.521481  0.860830  0.934605  0.079056
3    0.0450641  0.503060  0.283554  0.918563
4     0.469801  0.563382  0.713534  0.567341
5     0.875658  0.657706  0.602736  0.943114
..         ...       ...       ...       ...
329   0.692654  0.545235  0.513746  0.931380
330   0.711324  0.137499  0.943873  0.377274
331   0.377174  0.640129  0.342263  0.805632
332  0.0412277  0.746126  0.968953  0.130972
333    0.07112  0.929151  0.751339  0.001154

[333 rows x 4 columns]

In [89]:
newdf.drop(['D'], axis=1)

             A         B         C         E
1     0.346584  0.733863  0.219542  0.964678
2     0.521481  0.860830  0.921013  0.079056
3    0.0450641  0.503060  0.894929  0.918563
4     0.469801  0.563382  0.273213  0.567341
5     0.875658  0.657706  0.706306  0.943114
..         ...       ...       ...       ...
329   0.692654  0.545235  0.807676  0.931380
330   0.711324  0.137499  0.895745  0.377274
331   0.377174  0.640129  0.205477  0.805632
332  0.0412277  0.746126  0.757716  0.130972
333    0.07112  0.929151  0.533439  0.001154

[333 rows x 4 columns]

In [90]:
newdf.drop(['A', 'C'], axis=1, inplace=True)

In [91]:
newdf

            B         D         E
1    0.733863  0.581576  0.964678
2    0.860830  0.934605  0.079056
3    0.503060  0.283554  0.918563
4    0.563382  0.713534  0.567341
5    0.657706  0.602736  0.943114
..        ...       ...       ...
329  0.545235  0.513746  0.931380
330  0.137499  0.943873  0.377274
331  0.640129  0.342263  0.805632
332  0.746126  0.968953  0.130972
333  0.929151  0.751339  0.001154

[333 rows x 3 columns]

In [92]:
newdf.drop([1,5], axis=0, inplace=True)

In [93]:
newdf

            B         D         E
2    0.860830  0.934605  0.079056
3    0.503060  0.283554  0.918563
4    0.563382  0.713534  0.567341
6    0.812358  0.756576  0.271124
7    0.297369  0.154274  0.476544
..        ...       ...       ...
329  0.545235  0.513746  0.931380
330  0.137499  0.943873  0.377274
331  0.640129  0.342263  0.805632
332  0.746126  0.968953  0.130972
333  0.929151  0.751339  0.001154

[331 rows x 3 columns]

In [94]:
newdf.head(3)

          B         D         E
2  0.860830  0.934605  0.079056
3  0.503060  0.283554  0.918563
4  0.563382  0.713534  0.567341

In [95]:
newdf.reset_index()

     index         B         D         E
0        2  0.860830  0.934605  0.079056
1        3  0.503060  0.283554  0.918563
2        4  0.563382  0.713534  0.567341
3        6  0.812358  0.756576  0.271124
4        7  0.297369  0.154274  0.476544
..     ...       ...       ...       ...
326    329  0.545235  0.513746  0.931380
327    330  0.137499  0.943873  0.377274
328    331  0.640129  0.342263  0.805632
329    332  0.746126  0.968953  0.130972
330    333  0.929151  0.751339  0.001154

[331 rows x 4 columns]

In [96]:
newdf.reset_index(drop=True)

            B         D         E
0    0.860830  0.934605  0.079056
1    0.503060  0.283554  0.918563
2    0.563382  0.713534  0.567341
3    0.812358  0.756576  0.271124
4    0.297369  0.154274  0.476544
..        ...       ...       ...
326  0.545235  0.513746  0.931380
327  0.137499  0.943873  0.377274
328  0.640129  0.342263  0.805632
329  0.746126  0.968953  0.130972
330  0.929151  0.751339  0.001154

[331 rows x 3 columns]

In [97]:
newdf.reset_index(drop=True, inplace=True)

In [98]:
newdf.head(3)

          B         D         E
0  0.860830  0.934605  0.079056
1  0.503060  0.283554  0.918563
2  0.563382  0.713534  0.567341

In [100]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
326    False
327    False
328    False
329    False
330    False
Name: B, Length: 331, dtype: bool

In [101]:
newdf

            B         D         E
0    0.860830  0.934605  0.079056
1    0.503060  0.283554  0.918563
2    0.563382  0.713534  0.567341
3    0.812358  0.756576  0.271124
4    0.297369  0.154274  0.476544
..        ...       ...       ...
326  0.545235  0.513746  0.931380
327  0.137499  0.943873  0.377274
328  0.640129  0.342263  0.805632
329  0.746126  0.968953  0.130972
330  0.929151  0.751339  0.001154

[331 rows x 3 columns]

In [102]:
newdf['B'] =None

In [103]:
newdf

        B         D         E
0    None  0.934605  0.079056
1    None  0.283554  0.918563
2    None  0.713534  0.567341
3    None  0.756576  0.271124
4    None  0.154274  0.476544
..    ...       ...       ...
326  None  0.513746  0.931380
327  None  0.943873  0.377274
328  None  0.342263  0.805632
329  None  0.968953  0.130972
330  None  0.751339  0.001154

[331 rows x 3 columns]

In [106]:
newdf.loc[:,['B']].isnull()

        B
0    True
1    True
2    True
3    True
4    True
..    ...
326  True
327  True
328  True
329  True
330  True

[331 rows x 1 columns]

In [107]:
newdf.loc[:, ['B']] =56

In [108]:
newdf

      B         D         E
0    56  0.934605  0.079056
1    56  0.283554  0.918563
2    56  0.713534  0.567341
3    56  0.756576  0.271124
4    56  0.154274  0.476544
..   ..       ...       ...
326  56  0.513746  0.931380
327  56  0.943873  0.377274
328  56  0.342263  0.805632
329  56  0.968953  0.130972
330  56  0.751339  0.001154

[331 rows x 3 columns]